import '/src/styles/aboutus.css';
import Navbar from "./navbar";
import Footer from "./Footer";
import { Link } from 'react-router-dom';

function Aboutus() {
  return (
    <>
      <Navbar />
      <div className='aboutus-head'>
        <img src="/src/assets/tianyi-ma-WiONHd_zYI4-unsplash.jpg" alt="" className='aboutus-head-img' />
        <p className='aboutus-head-p'>با ما بیشتر اشنا شوید</p>
      </div>
      <div className='aboutus-body'>
        <img src="./src/assets/sanjaghak-logo.png" alt="" className='aboutus-body-logo' />
        <p className='aboutus-body-p'>اینجا جاییه برای عاشقای تکنولوژی! <br />
          از گوشی و هدفون گرفته تا کلی وسیله‌ی الکترونیکی باحال دیگه که هم کیفیت دارن، هم قیمتشون منصفانه‌ست. ما توی سنجاقک سعی کردیم محصولاتی رو جمع کنیم که هم کاربردی باشن، هم ظاهر خوبی داشته باشن، هم بتونن بخشی از یه زندگی دیجیتالی راحت‌تر و هوشمندتر باشن.
          <br /> <br />
          سنجاقک یه پروژه‌ی دانشگاهیه که با یه تیم چند نفره از دوستای دانشجومون تصمیم گرفتیم راه‌اندازیش کنیم. هر کدوم‌مون یه گوشه‌ی کار رو گرفتیم؛ از طراحی ظاهر سایت و کدنویسی گرفته تا انتخاب محصولات، نوشتن توضیحات، تست عملکرد و کلی جزئیات دیگه. این پروژه برای ما فقط یه تمرین درسی نبود؛ یه تجربه واقعی بود برای یاد گرفتن کار گروهی، روبه‌رو شدن با چالش‌ها و ساختن چیزی که واقعاً بهش افتخار کنیم.
          <br />
          هدفمون این بود که یه فروشگاه آنلاین بسازیم که کار کردن باهاش راحت باشه، ظاهرش ساده و دلنشین باشه و از همه مهم‌تر، حس خوبی به کاربر بده. دوست داشتیم بازدید از سنجاقک مثل قدم زدن توی یه فروشگاه خلوت و مرتب باشه که همه‌چی سر جاشه و انتخاب‌کردن آسونه.
          <br /> <br />
          چرا اسممون <Link to="/" id='aboutus-span'>سنجاقک</Link>  شد؟
          چون سنجاقک برای ما نماد چیزهاییه که توی این پروژه دنبالش بودیم: سرعت، سبکبالی و دقت. ما می‌خواستیم سنجاقک هم سریع باشه، هم سبک، هم دقیق؛ درست مثل پرواز همون موجود کوچیکی که الهام‌بخش‌مون شد.
        </p>
      </div>
      <div>
        <img src="/src/assets/Frame 1890166595.png" alt="" className='aboutus-under-body-img' />
        <p className='aboutus-under-body-p'>مهم نیست شما کجا هستید <br /> ما همه جا هستیم</p>
      </div>
      <Footer />
    </>
  );
}

export default Aboutus;
